Repository: 2jzone/Maize-Watch-Test
Catalog: frontend/mobile/lib/l10n/app_*.arb
Languages: tl

# welcome
source: Welcome to Maize Watch
tl: Maligayang pagdating sa Maize Watch

# description
source: Maximize your yields, minimize your worries.
tl: Palaguin ang ani, bawasan ang alalahanin.

# register_page1_title
source: Let's get you started
tl: Umpisahan na natin

# register_page1_description
source: Help us get to know you better.
tl: Tulungan mo kaming makilala ka nang mas mabuti.

source: First Name
tl: Pangalan

source: Last Name
tl: Apelyido

# contact_number
source: 10-digit Contact Number
tl: 10-digit Numero ng Telepono

source: Address
tl: Tirahan

# register_page2_title
source: Hi,
tl: Kamusta,

# register_page2_description
source: Please fill in the form to proceed.
tl: Pakisagutan ang form upang magpatuloy.

source: Username
tl: Pangalan ng Gamit

source: Confirm Password
tl: Kumpirmahin ang Password

source: User ID not found
tl: Hindi mahanap ang iyong User ID

# first_name_required
source: First name is required
tl: Kailangan ang pangalan

# last_name_required
source: Last name is required
tl: Kailangan ang apelyido

# contact_number_required
source: Contact number is required
tl: Kailangan ang numero ng telepono

# valid_ph_number_required
source: Enter a valid Philippine mobile number
tl: Maglagay ng wastong numero ng telepono sa Pilipinas

# address_required
source: Address is required
tl: Kailangan ang address

# username_required
source: Username is required
tl: Kailangan ang username

# username_too_short
source: Username must be at least 3 characters
tl: Ang username ay dapat may hindi bababa sa 3 karakter

# registration_successful
source: Registration successful! Please input your corn information.
tl: Matagumpay ang pagpaparehistro! Mangyaring mag-lagay ng impormasyon tungkol sa mais.

# connection_error
source: Connection error. Please check your internet and try again.
tl: May problema sa koneksyon. Pakisuri ang iyong internet at subukang muli.

# username_already_exists
source: Username already exists. Please try another one.
tl: Ginagamit na ang username. Pakisubukang muli gamit ang ibang username.

# registration_timeout
source: The server is taking too long to respond. Your account may have been created. Please try logging in.
tl: Masyado nang matagal ang paghihintay sa server. Maaaring nalikha na ang iyong account. Subukang mag-login.

# registration_failed
source: Registration failed. Please try again.
tl: Hindi matagumpay ang pagpaparehistro. Pakisubukang muli.

# password_required
source: Password is required
tl: Kailangan ang password

# password_too_short
source: Password must be at least 6 characters
tl: Ang password ay dapat may hindi bababa sa 6 na karakter

# passwords_dont_match
source: Passwords do not match
tl: Hindi magkatugma ang mga password

# login_failed
source: Login failed. Please log in manually.
tl: Hindi matagumpay ang pag-login. Mangyaring mag-login ng manu-mano.

source: Try Again
tl: Subukang Muli

# no_corn_fields
source: No corn fields found
tl: Walang natagpuang taniman ng mais

# register_corn_field_prompt
source: Please register a corn field to start tracking progress.
tl: Mangyaring magrehistro ng taniman ng mais upang masimulan ang pagsubaybay.

source: Days Since Planting
tl: Mga Araw Mula Nang Itanim

source: Current Growth Stage
tl: Kasalukuyang Yugto ng Paglaki

source: Growth Timeline
tl: Takbo ng Paglaki

source: days
tl: araw

# agreement_prefix
source: By logging in, you agree to our
tl: Sa pag-login, sumasang-ayon ka sa aming

source: Privacy Policy
tl: Patakaran sa Privacy

source: and
tl: at

source: Terms of Service
tl: Mga Tuntunin ng Serbisyo

# invalid_credentials
source: Invalid username or password
tl: Di-wastong username o password

# all_fields_required
source: All fields are required.
tl: Kinakailangang punan ang lahat ng mga patlang.

source: Done
tl: Tapos na

# register_corn_next
source: Register your corn next
tl: I-rehistro ang mais

# register_corn_button
source: Register Corn
tl: Magrehistro ng Mais

source: Corn Registration
tl: Rehistrasyon ng Mais

source: Field Information
tl: Impormasyon ng Bukid

source: Field Name
tl: Pangalan ng Bukid

source: Location
tl: Lokasyon

source: Soil Type
tl: Uri ng Lupa

source: Corn
tl: Mais

source: Corn Variety
tl: Uri ng Mais

source: Planting Date
tl: Petsa ng Pagtatanim

source: Growth Stage
tl: Yugto ng Paglaki

source: Review and Submit
tl: Suriin at Isumite

source: Submit
tl: Isumite

source: Select Date
tl: Pumili ng Petsa

# field_name_required
source: Field name is required
tl: Kinakailangan ang pangalan ng bukid

# soil_type_required
source: Soil type is required
tl: Kinakailangan ang uri ng lupa

# step1_title
source: Field
tl: Bukirin

# step2_title
source: Soil
tl: Lupa

# step3_title
source: Corn
tl: Mais

# step4_title
source: Season
tl: Panahon

# step5_title
source: Age
tl: Edad

# field_name_label
source: Field Name
tl: Pangalan ng Bukirin

# location_label
source: Location
tl: Lokasyon

# back_button
source: Back
tl: Bumalik

# next_button
source: Next
tl: Susunod

# submit_button
source: Submit
tl: Isumite

# soil_type_title
source: Choose your field’s soil type
tl: Piliin ang uri ng lupa ng iyong bukirin

# corn_variety_title
source: Choose your preferred corn variety
tl: Piliin ang nais mong uri ng mais

# planting_season_title
source: When did you plant?
tl: Kailan ka nagtanim?

# planting_season_description
source: Select the date you planted your corn
tl: Piliin and petsa ng pagtatanim ng mais.

# corn_age_title
source: How old is your corn crop?
tl: Ilang taon na ang iyong pananim na mais?

# soil_clay
source: Clay
tl: Luwad

# soil_silt
source: Silt
tl: Lamo

# soil_sandy
source: Sandy
tl: Mabuhangin

# soil_peaty
source: Peaty
tl: Pit

# soil_saline
source: Saline
tl: Alat

# variety_glutinous
source: Glutinous (Malagkit)
tl: Malagkit

# variety_yellow_dent
source: Yellow Dent
tl: Dilaw na Dent

# variety_white_fodder
source: White Fodder
tl: Puting Fodder

# variety_sweet
source: Sweet
tl: Matamis

# variety_purple
source: Purple
tl: Ube

# season_wet
source: Wet Season (June to November)
tl: Panahong Tag-ulan (Hunyo hanggang Nobyembre)

# season_dry
source: Dry Season (December to May)
tl: Panahong Tag-init (Disyembre hanggang Mayo)

# season_both
source: Both Seasons
tl: Parehong Panahon

# phSensor
source: pH Level Sensor
tl: Sensor ng Antas ng pH

# tempHumidSensor
source: Temperature & Humidity Sensor
tl: Sensor ng Temperatura at Humidity

source: Soil Moisture Sensor
tl: Sensor ng Halumigmig ng Lupa

source: Enable Notifications
tl: Paganahin ang Abiso

source: Vibration Only
tl: Vibrasyon Lamang

# soundAndVibrate
source: Sound & Vibrate
tl: Tunog at Vibrate

source: Corn Growth
tl: Paglago ng Mais

# days_to_next_stage
source: {days} days to next stage ({rate}/day)
tl: {days} araw hanggang susunod na yugto ({rate}/araw)

# ve_emergence
source: Emergence (VE)
tl: Pagsibol (VE)

# v3_early_growth
source: Early Growth (V3)
tl: Unang Paglago (V3)

# v8_mid_growth
source: Mid Growth (V8)
tl: Gitnang Paglago (V8)

# vt_tasseling
source: Tasseling (VT)
tl: Pagbubulaklak (VT)

# r1_silking
source: Silking (R1)
tl: Pagsilk (R1)

# r6_mature
source: Mature (R6)
tl: Ganap na Mais (R6)

source: Just sprouting from soil
tl: Sumisilang pa lang mula sa lupa

# leaves_3_5_developed
source: 3-5 leaves developed
tl: May 3-5 dahon na

# leaves_8_10_developed
source: 8-10 leaves, growing taller
tl: May 8-10 dahon, lumalaki na

# tassels_appearing
source: Tassels appearing at top
tl: Lumalabas na ang mga bulaklak sa tuktok

# silks_emerging
source: Silks emerging from ears
tl: Lumalabas na ang silk mula sa tainga

source: Fully developed corn
tl: Ganap nang mais

# stable
source: Growth is stable
tl: Matatag ang paglago

# healthy_growth
source: Healthy growth rate
tl: Malusog ang bilis ng paglago

# rapid_growth
source: Rapid growth detected!
tl: Mabilis ang paglago!

# declining
source: Growth is declining
tl: Humihina ang paglago

# growth_stage_ve
source: Emergence
tl: Pag-usbong

# growth_stage_ve_desc
source: Just sprouting from soil
tl: Kakauusbong mula sa lupa

# growth_stage_v3
source: Early Growth
tl: Maagang Paglago

# growth_stage_v3_desc
source: 3-5 leaves developed
tl: May 3-5 dahon na

# growth_stage_v8
source: Mid Growth
tl: Gitnang Paglago

# growth_stage_v8_desc
source: 8-10 leaves, growing taller
tl: 8-10 dahon, tumataas

# growth_stage_vt
source: Tasseling
tl: Paglabas ng Bulaklak

# growth_stage_vt_desc
source: Tassels appearing at top
tl: May bulaklak na sa tuktok

# growth_stage_r1
source: Silking
tl: Paglabas ng Buhok

# growth_stage_r1_desc
source: Silks emerging from ears
tl: May buhok na sa tenga

# growth_stage_r6
source: Mature
tl: Ganap na Hinog

# growth_stage_r6_desc
source: Fully developed corn
tl: Lubos nang hinog ang mais

# soil_loamy
source: Loamy
tl: Loam

# soil_loamy_desc
source: Mix of sand, silt, clay
tl: Halo ng buhangin, lamo, luwad

# soil_sandy_desc
source: Light, drains quickly
tl: Magaan, mabilis ang daloy ng tubig

# soil_clay_desc
source: Heavy, holds water
tl: Mabigat, humahawak ng tubig

# soil_silty
source: Silty
tl: Lamo

# soil_silty_desc
source: Smooth, holds moisture
tl: Makinis, humahawak ng moisture

# variety_sweet_corn
source: Sweet Corn
tl: Matamis na Mais

# variety_sweet_corn_desc
source: For human consumption
tl: Para sa pagkain ng tao

# variety_field_corn
source: Field Corn
tl: Pang-maisang Bukid

# variety_field_corn_desc
source: For animal feed, ethanol
tl: Para sa hayop o ethanol

# variety_popcorn_desc
source: For popping
tl: Para sa popcorn

# variety_flint_corn
source: Flint Corn
tl: Makintab na Mais

# variety_flint_corn_desc
source: Colorful, decorative
tl: Makukulay, palamuti

source: Settings
tl: Mga Setting

source: Language
tl: Wika

source: Log In
tl: Mag-login

source: Register
tl: Magrehistro

source: Next
tl: Susunod

source: Back
tl: Bumalik

source: Notifications
tl: Mga Abiso

source: Enable Notifications
tl: Paganahin ang Mga Abiso

source: Vibration Only
tl: Panginginig Lamang

source: Vibrate
tl: Panginginig

# sound_and_vibrate
source: Sound & Vibrate
tl: Tunog at Panginginig

source: Sensors
tl: Mga Sensor

# ldr_sensor
source: Light Dependent Resistor
tl: Sensor ng Liwanag

# ph_sensor
source: PH Level of Soil
tl: PH Antas ng Lupa

# temp_humid_sensor
source: Temperature and Humidity
tl: Temperatura at Humidity

# soil_moisture_sensor
source: Soil Moisture
tl: Halumigmig ng Lupa

source: On
tl: Bukas

source: Off
tl: Patay

# help_title
source: Help
tl: Tulong

# help_description
source: This section provides information to help users understand the app features and usage. Learn how to monitor your plants, configure settings, and interpret sensor data.
tl: Nagbibigay ang seksyong ito ng impormasyon upang matulungan ang mga user na maunawaan ang mga tampok at paggamit ng app.

# faq_q1
source: What do the sensor indicators mean?
tl: Ano ang ibig sabihin ng mga indicator ng sensor?

# faq_a1
source: Green indicates the sensor is working properly, while red means there may be an issue.
tl: Ang berde ay nangangahulugang maayos ang sensor, habang ang pula ay maaaring may problema.

# faq_q2
source: How often does the app update sensor data?
tl: Gaano kadalas ina-update ang datos ng sensor?

# faq_a2
source: Sensor data is updated every 5 seconds automatically.
tl: Ina-update ang datos bawat 5 segundo.

source: Account
tl: Akunta

source: About User
tl: Tungkol sa User

source: About
tl: Tungkol

# about_app
source: The maize-watch mobile app proposes an innovative, IoT-driven corn monitoring system enhanced by prescriptive analytics. This system will not only provide real-time data on crop health and environmental conditions but also use these data to offer practical advice, further optimizing maize quality and yield.
tl: Ang maize-watch app ay isang IoT-driven na sistema na may prescriptive analytics para sa pag-monitor ng mais.

source: Log out
tl: Mag-logout

# logout_title
source: Logout Confirmation
tl: Kumpirmasyon ng Logout

# logout_message
source: Are you sure you want to logout from your account?
tl: Sigurado ka bang gusto mong mag-logout?

# exit_app_title
source: Exit Application
tl: Lumabas ng App

# exit_app_message
source: Are you sure you want to exit the application?
tl: Sigurado ka bang gusto mong lumabas ng application?

# logout_error
source: There was a problem logging out. Please try again.
tl: Nagkaroon ng problema sa pag-logout. Pakisubukang muli.

source: Yes
tl: Oo

source: No
tl: Hindi

# greeting_morning
source: Good Morning
tl: Magandang Umaga

# greeting_afternoon
source: Good Afternoon
tl: Magandang Hapon

# greeting_evening
source: Good Evening
tl: Magandang Gabi

# default_user
source: farmer
tl: magsasaka

# crop_condition_title
source: Crop Condition
tl: Kondisyon ng Pananim

# crop_condition_subtitle
source: Check the current status of your maize crop and get personalized recommendations.
tl: Tingnan ang kasalukuyang kondisyon ng iyong mais at tumanggap ng rekomendasyon.

source: Temperature
tl: Temperatura

source: Humidity
tl: Halumigmig

source: Soil Moisture
tl: Halumigmig ng Lupa

source: Rainfall
tl: Ulan

source: Refresh
tl: I-refresh

source: Last updated
tl: Huling na-update

source: minutes ago
tl: minuto ang nakalipas

source: hours ago
tl: oras ang nakalipas

source: days ago
tl: araw ang nakalipas

source: just now
tl: ngayon lang

source: Crop Health
tl: Kalusugan ng Pananim

source: Excellent
tl: Napakahusay

source: Good
tl: Maganda

source: Fair
tl: Katamtaman

source: Poor
tl: Mahina

source: Critical
tl: Kritikal

# recommendation_title
source: Recommendations
tl: Mga Rekomendasyon

source: View Details
tl: Tingnan ang Detalye

source: See More
tl: Tingnan Pa

source: View more details
tl: Tingnan ang karagdagang detalye

source: seconds ago
tl: segundo ang nakalipas

source: No Data
tl: Walang Datos

# crop_excellent
source: Your crops are in excellent condition.
tl: Napakahusay ng kondisyon ng iyong mga pananim.

# crop_okay
source: Your crops are doing okay. Monitor closely.
tl: Maayos ang pananim. Bantayan pa rin.

# crop_risk
source: Crops are at risk! Immediate action needed.
tl: Nasa panganib ang pananim! Agarang aksyon ang kailangan.

# stay_updated
source: Stay updated with your farm!
tl: Manatiling updated sa iyong sakahan!

# moisture_too_dry
source: The soil is too dry. Irrigation is highly recommended to prevent plant stress.
tl: Sobrang tuyo ng lupa. Kailangan ng irigasyon.

# moisture_low
source: The soil moisture is low. Consider watering soon to maintain healthy growth.
tl: Mababa ang halumigmig ng lupa. Magdilig sa lalong madaling panahon.

# moisture_optimal
source: The soil moisture is at an optimal level. Plants are in good condition.
tl: Tamang-tama ang halumigmig ng lupa. Maayos ang kondisyon.

# moisture_fairly_moist
source: The soil is fairly moist. Monitor for potential overwatering.
tl: Medyo basa ang lupa. Bantayan laban sa sobrang tubig.

# moisture_too_wet
source: The soil is too wet. Risk of root rot and fungal diseases is high.
tl: Sobrang basa ng lupa. Panganib ng pagkabulok ng ugat.

source: Light Intensity
tl: Liwanag

source: Very Dry
tl: Sobrang Tuyo

source: Dry
tl: Tuyo

source: Moist
tl: Basa

source: Wet
tl: Basang-basa

source: Low
tl: Mababa

source: High
tl: Mataas

source: Very High
tl: Napakataas

source: Dim
tl: Maliwanag

source: Low Light
tl: Mahinang Liwanag

source: Bright
tl: Maliwanag

source: Very Bright
tl: Napakaliwanag

# humidity_title
source: Humidity
tl: Halumigmig

# humidity_very_dry
source: The air is very dry, typical of arid environments.
tl: Sobrang tuyo ng hangin.

# humidity_moderate
source: The air has moderate humidity, comfortable for plant transpiration.
tl: Katamtamang halumigmig ng hangin.

# humidity_quite_humid
source: The air is quite humid, often associated with moist environments.
tl: Medyo mahalumigmig ang hangin.

# humidity_very_humid
source: The air is very humid, common before rainfall or in tropical climates.
tl: Sobrang mahalumigmig ng hangin.

# light_intensity_title
source: Light Intensity
tl: Liwanag

# light_intensity_very_low
source: The light intensity is very low, resembling evening or dense shade.
tl: Sobrang hina ng liwanag.

# light_intensity_moderate
source: The light intensity is moderate, similar to cloudy daylight.
tl: Katamtamang liwanag.

# light_intensity_bright
source: The light intensity is bright, close to clear daytime conditions.
tl: Maliwanag ang kapaligiran.

# light_intensity_very_strong
source: The light intensity is very strong, similar to direct midday sunlight.
tl: Napakaliwanag gaya ng tanghaling tapat.

# helpTitle
source: Help
tl: Tulong

# helpDescription
source: Here’s some helpful info.
tl: Narito ang ilang kapaki-pakinabang na impormasyon.

# faqTitle
source: FAQs
tl: Mga Madalas Itanong

# faqQ1
source: How do I enable notifications?
tl: Paano ko i-on ang mga notipikasyon?

# faqA1
source: Go to settings and toggle the switch.
tl: Pumunta sa mga setting at i-toggle ang switch.

# faqQ2
source: How to reset my password?
tl: Paano i-reset ang aking password?

# faqA2
source: Click ‘Forgot Password’ on the login screen.
tl: I-click ang ‘Nakalimutan ang Password’ sa login screen.

# aboutApp
source: Maize Watch is a crop monitoring application designed to help farmers keep track of maize growth and identify issues quickly.
tl: Ang Maize Watch ay isang crop monitoring application na tumutulong sa mga magsasaka na subaybayan ang paglago ng mais at agad na matukoy ang mga problema.

# versionInfo
source: version 1.0.0
tl: bersyon 1.0.0

# contactUs
source: Contact us at:
tl: Makipag-ugnayan sa amin sa:

source: Translate
tl: Isalin
